Autodesk.Revit.DB.FolderItemInfo.GetGroupingParameterIdPath
The parameter Id path used to determine the folder items in the browser.
Remarks:
A parameter Id path consists of reference parameter Id(s) {0...n} + paramId,
and the value of the last parameter in the path is the one that is used to determine the folder items in the browser.
Reference parameter is ElementId valued parameter used to retrieve related element, its parameter value is the related element Id.
Given an Element, get the value of reference parameter and use the ElementId value to retrieve the referenced element.
Each paramId in the path except for the last one is a reference parameter pointing to the next element.
Recursively get next element through element obtained in the previous round with the next paramId in the path,
finally get the value of the last parameter.
Since:
2026

Autodesk.Revit.DB.FolderItemInfo
Contains data for each folder item in the organization settings of the project browser including grouping parameter Id path and folder name.
Remarks:
FolderItemInfo is the return value of BrowserOrganization.GetFolderItems().
Since:
2015